{
    "email" : "autumn.m.hoerr@gmail.com",
	"phone" : "(410) 807-6800",
	"address" : "Wilmington, NC",
	"website" : "autumnhoerr.com",
	"github" : "https://github.com/autumn-hoerr",
    "education" : {
        "college" : "Maryland Institute College of Art",
        "location" : "Baltimore, MD",
        "class" : "2007",
        "degree" : "BFA in Interactive Media (now known as Interactive Arts)"
    },
    "description" : "I’m a front-end developer and manager who loves exploring, learning, and perfecting my craft. I’ve been lucky to work with and mentor teams of people who share the same passion. My technical expertise started with the core of HTML, CSS, and Javascript but has expanded over time to the broader tasks of how projects are structured, how to develop code for ease of understanding and modularity, and even to devops. I enjoy solving the small-scale CSS oddities as much as planning out our largest site deployments. Ultimately my passion is for expanding my knowledge, my capabilities, and the quality of my work. This passion extends past web development into all of my hobbies be it homebrewing, 3D printing, welding, woodworking, or metalworking. There is always more to explore, learn, and share.",
    "jobs" : [
        {
            "company" : "AppDirect",
            "title" : "Head of Web Development",
            "years" : "2016 - present",
            "description" : "Since 2016 I’ve led the development team for the Marketing organization within AppDirect. We are responsible for maintaining the fleet of sites to support various go-to-market motions for the company. During my tenure, we’ve grown from a dev team of 2 to 5, a company of 80 to over 500 employees, and redesigned and deployed AppDirect.com 4 times as our needs and goals changed.",
            "projects" : [
                {
                    "title" : "AppDirect.com",
                    "URL" : "https://www.appdirect.com",
                    "description": "brief description of what I did and was responsible for"
                },
                {
                    "title" : "AppSmart.com",
                    "URL" : "https://www.appsmart.com",
                    "description": "brief description of what I did and was responsible for"
                },
                {
                    "title" : "AppDirect.com",
                    "URL" : "https://www.appdirect.com",
                    "description": "brief description of what I did and was responsible for"
                }
            ]
        },
        {
            "company" : "AppDirect",
            "title" : "Web Developer",
            "years" : "2012 - 2016",
            "description" : "I started at AppDirect as a contractor in early 2012 to support the acquisition and rebranding of jBilling. After the project, they brought me on full time. Over the years there were additional acquisitions to rebrand, a multitenant ruby on rails app integrated with the marketplace to provide documentation to customers, and numerous company initiatives  to support.",
            "projects" : [
                {
                    "title": "jBilling.com",
                    "URL" : "https://www.jbilling.com",
                    "description" : "Marketing site for jBilling; acquired and rebranded by AppDirect in 2012. This was my first project for AppDirect and it mostly remains as originally launched. I worked with a senior developer to platform the site in Expression Engine, and was responsible for a lot of the HTML, CSS, and JS that you can still see on the site."
                }
            ]
        },
        {
            "company" : "idfive",
            "title" : "Senior Web Developer",
            "years" : "2010 - 2012",
            "description" : "Led frontend production and integration efforts, oversaw production vendor selection and management, responsive/mobile design, occasional wireframing, and analytics analysis. Unfortunately, no projects that I worked on remain online in their original form. Clients included the University of Baltimore, The University of Maryland School of Pharmacy, ASQ/Paul H. Brookes Publishing Co., Inc. and Vaccinogen among others."
        },
        {
            "company" : "The National Museum of American History",
            "title" : "New Media Assistant",
            "years" : "2008 - 2010",
            "description" : "Everything from content entry for online exhibitions to designing, producing and maintaining the email newsletter and touchscreen exhibition kiosks."
        }
    ]
}

